import streamlit as st
import pandas as pd

st.header("📍地图")

map_data = {
       
       'latitude':[22.853950,22.806988,22.814813,22.832621,22.797759],
       'longitude':[108.222458,108.363594,108.322737,108.289747,108.314627]
    }

mp_df = pd.DataFrame(map_data)
st.map(mp_df)

#定义数据
re_data = {
      "餐厅":["朴大叔拌饭","重庆小面","蜜雪冰城","三品王汤饭","古茗"],
      "评分":[4.2,4.8,6.0,4.0,5.2],
      "价格":[22,8,10,30,15]
    }
#创建数据框
df = pd.DataFrame(re_data)

st.header("🌟餐厅评分")
st.bar_chart(df.set_index('餐厅')['评分'])


# 定义数据,以便创建数据框
jg_data = {
    '月份': ['01', '02', '03', '04', '05', '06', '07', '08', '09', '10', '11', '12'],
    '朴大叔拌饭': [20, 17, 18, 26, 27, 24, 15, 16, 19, 17, 30, 19],
    '蜜雪冰城': [13, 17, 18, 10, 8, 15, 15, 16, 9, 10, 10, 12],
    '古茗': [20, 17, 18, 16, 22, 12, 15, 16, 19, 12, 10, 15],
    '三品王': [20, 17, 18, 30, 24, 24, 22, 16, 19, 17, 25, 19],
    '重庆小面': [10, 14, 18, 13, 14, 14, 15, 10, 12, 14, 10, 13],
}
# 根据上面创建的data，创建数据框
df = pd.DataFrame(jg_data)
# 定义数据框所用的新索引
index = pd.Series([1, 2, 3, 4, 5,6,7,8,9,10,11,12], name='序号')
# 将新索引应用到数据框上
df.index = index

# 修改df，用月份列作为df的索引，替换原有的索引
df.set_index('月份', inplace=True)

st.subheader("💰不同门店价格")
# 通过width、height和use_container_width指定折线图的宽度和高度
st.line_chart(df, width=600, height=300, use_container_width=False)

data = {
    '月份': ['01', '02', '03', '04', '05', '06', '07', '08', '09', '10', '11', '12'],
    '朴大叔拌饭': [20022, 51454, 28685, 22652, 22714, 22454, 21578, 21678, 21945, 21735, 30543, 21945],
    '蜜雪冰城': [12230, 17543, 18356, 16350, 85463, 15545, 154254, 14226, 52559, 531210, 45510, 52312],
    '古茗': [20125, 17454, 54218, 55316, 22332, 15532, 33355, 53316, 75319, 353512, 35310, 3315],
    '三品王': [33320, 33517, 32318, 32330, 23324, 35324, 33522, 53316, 33519, 5317, 57525, 33519],
    '重庆小面': [32510, 3314, 5518, 3513, 35314, 35314, 5315, 35510, 135332, 15444, 54310, 22013],
}
# 根据上面创建的data，创建数据框
df = pd.DataFrame(data)
# 定义数据框所用的新索引
index = pd.Series([1, 2, 3, 4, 5,6,7,8,9,10,11,12], name='序号')
# 将新索引应用到数据框上
df.index = index

# 修改df，用月份列作为df的索引，替换原有的索引
df.set_index('月份', inplace=True)


st.subheader("🕐用餐高峰时间段")
# 通过width、height和use_container_width指定面积图的宽度和高度
st.area_chart(df, width=600, height=300, use_container_width=False)
